{"batchcomplete": "", "query": {"pages": {"6971005": {"pageid": 6971005, "ns": 0, "title": "Alan Sullivan", "extract": "Edward Alan Sullivan (November 29, 1868 — August 6, 1947) was a Canadian poet and author of short stories. He is noted for his 1935 historical adventure novel The Great Divide, which depicts the construction of the Canadian Pacific Railway.\n\n\n== History ==\nBorn in St. George's Rectory, Montreal, he was the oldest son of Edward Sullivan and Frances Mary Renaud. In 1869, his father became rector of Trinity Church, Chicago. The family lived to the city in 1871, and thus witnessed the Great Chicago Fire. When he was 15, he began attending Loretto in Musselburgh, Scotland, a famous school for boys.\nOn his return to Canada, he attended the School of Practical Science, Toronto. After this he did railway exploration work in the West, and later worked in mining. He was assistant engineer in the Clergue enterprises at Sault Ste. Marie, Ontario for a year and a half, before the organization of the Consolidated Lake Superior Company. Subsequently, he spent several years as a mining engineer in the Lake of the Woods district during the period of its gold exploitation.\n\n\n== Writing ==\nHe gained recognition in the United States through his poems, short stories and comprehensive articles on various themes. These frequently appeared in Harper's Magazine, the Atlantic Monthly, and other leading American periodicals. In 1941 he won the Governor General's Award for English-language fiction for the novel Three Came to Ville Marie. Wonder Stories reviewed his lost race novel In the Beginning favorably, saying its depiction of an encounter between modern men and Pleistocene-era tribesmen was a \"most tremendous drama of inter-racial conflict\".\n\n\n== Selected bibliography ==\nThe Passing of Oul-i-but (1913)\nBlantyre — Alien (1914)\nThe Inner Door (1917)\nAviation in Canada, 1917-18 (1919)\nThe Rapids (1920)\nThe Crucible (1925)\nThe Jade God (1925)\nHuman Clay (1926; as Sinclair Murray)\nIn the Beginning (1926; as Sinclair Murray)\nThe Splendid Silence (1927)\nWhispering Lodge (1927)\nUnder the Northern Lights (1928) Short Story collection:\nTrade\nThe Eyes of Sebastien\nThe Spirit of the North\nThe Circuit of the Wild Swan\nThe Blindness of Pituluk\nMotherhood\nThe Magic of Kahdoosh\nThe Reward of Kwasind\nThe Loyalty of Peeguk\nThe Passing of Chantie, the Curlew\nThe Affair of Kalauk, the Skilful Hunter\nThe Salving of Pyack\nA Little Way Ahead (1930; as Sinclair Murray)\nThe Magic Makers (1930)\nThe Golden Foundling (1931)\nThe Great Divide (1935)\nWith Love from Rachel (1938)\nThree Came to Ville Marie (1941)\nCariboo Road (1946)\n\n\n== References ==\n\nBiography by John Garvin, dated 1916\nFull e-text of Under the Northern Lights, hosted by Project Gutenberg of Australia\nPartial e-text of The Passing of Oul-i-but, hosted by Mount Royal CollegeGordon D. McLeod. Essentially Canadian: The Life and Fiction of Alan Sullivan. Waterloo, Ontario: Wilfrid Laurier University Press, 1982.\n\n\n== External links ==\nWorks by Alan Sullivan at Project Gutenberg\nWorks by Alan Sullivan at Faded Page (Canada)\nWorks by or about Alan Sullivan at Internet Archive\nWorks by Alan Sullivan at LibriVox (public domain audiobooks) \nWorks by Alan Sullivan at Digital Archive (Toronto Public Library)"}}}}